tap "airbnb/main", "git@git.musta.ch:airbnb/homebrew-main.git"
tap "airbnb/dataeng", "git@git.musta.ch:airbnb/homebrew-dataeng.git"

brew "awscli"
brew "bazelisk"
brew "watchman"
brew "ykman"
brew "nvm"
brew "gnu-tar"
brew "pyenv"
brew "bison"
brew "go"
brew "kubectx"
brew "golangci-lint"

# See https://developers.a.musta.ch/docs/default/component/frontend/getting-started/#nvm-node-yarn-homebrew-bazel
brew "cmake"
brew "pkg-config"
brew "cairo"
brew "pango"
brew "libpng"
brew "jpeg"
brew "giflib"
brew "librsvg"
brew "python-setuptools"

# Oneflow CLI tool for running/testing Airflow DAGs
brew "of"

# JDKs
cask "corretto@8"
cask "corretto@11"
cask "corretto@17"
cask "corretto@21"

cask "1password"
cask "asana"
cask "docker"
cask "google-chrome"
cask "postman"
cask "visual-studio-code"
