tap "gdubw/gng"
tap "BalliAsghar/apps"

brew "bat"       # better cat
brew "broot"     # interactive tree
brew "ddate"     # Discordian date
brew "direnv"    # customize env per directory
brew "fx"        # interactive JSON browser 
brew "gh"        # GitHub CLI
brew "git"
brew "git-delta" # better diff for git
brew "glow"      # terminal markdown rendering
brew "gng"       # smart gradle command, uses wrapper or falls back to installed
brew "jq"
brew "killport"
brew "lazygit"   # terminal GUI for git
brew "lsd"       # better ls
brew "micro"     # simple editor
brew "proselint" # lint English text / markdown
brew "ripgrep"
brew "starship"  # terminal prompt
brew "thefuck"   # fix commands with typos
brew "tldr"      # simple man
brew "tree"
brew "vhs"       # record terminal actions to GIF
brew "watch"
brew "zoxide"    # better cd / autojump
brew "zsh-syntax-highlighting"
brew "zsh-autosuggestions" # autocomplete from history with muted hints

# terminal fonts
cask "font-iosevka-term-nerd-font"
cask "font-iosevka-term-slab-nerd-font"

cask "arc"       # browser
cask "iterm2"    # better terminal
cask "ghostty"
cask "jetbrains-toolbox"
cask "obsidian"

mas "Pixelmator Pro", id: 1289583905
mas "Slack", id: 803453959
mas "Amphetamine", id: 937984704
