tap "nextfire/tap"

brew "roll"      # dice roller
brew "apple-music-discord-rpc"

cask "1password"
cask "calibre"
cask "camo-studio" # use phone as webcam
cask "discord"
cask "handbrake-app"
cask "proton-pass"
cask "protonvpn"
cask "vlc"
cask "zoom"
cask "zulu@21"   # JDK

# gaming stuff
cask "crossover"
cask "nvidia-geforce-now"
cask "steam"
cask "sony-ps-remote-play"

mas "Affinity Publisher 2", id: 1606941598
mas "Kindle", id: 302584613
mas "Keynote", id: 409183694
mas "HP Easy Scan", id: 967004861
